/*************************************************/
/*【程式名稱】: 5_2powern_r.c                    */
/*【程式功能】: 遞迴函數(式)：計算 2 的 n 次方   */
/*       輸入 : 整數 n                           */
/*       輸出 : 2 的 n 次方                      */
/*【資料結構】: 遞迴                             */
/*************************************************/

#include <stdio.h>

long two_power_n(long n);

/*------------------------------------*/
/*   以遞迴方式計算 2 的 n 次方之值   */
/*------------------------------------*/
long two_power_n(long n)
{
   if(n == 0)
      return 1;   
   if(n == 1)
      return 2;
   if(n > 1)
     	return (2 * two_power_n(n-1)); 
   else 
      printf("\n錯誤! n 必須為正整數!\n");
}

void main(void)
{
   int i;

   clrscr( );
   for(i=0; i <= 5; i++){
      printf("\n==> 2 的 %d 次方 = %ld",i,two_power_n(i));
   }
}