/**************************************************************/
/*【程式名稱】: 2_cards.c                                     */
/*【程式功能】: 列印撲克牌的所有點數                          */
/*       輸入 : 無                                            */
/*       輸出 : 依黑桃,梅花,方塊,紅心順序列印撲克牌的所有點數 */
/*【資料結構】: 陣列結構                                      */
/**************************************************************/
/*【變數名稱及用途】                                          */
/*      cf[4] : 儲存撲克牌花色                                */
/*     cp[13] : 儲存撲克牌點數                                */
/**************************************************************/

#include <stdio.h>

char cf[4] = {6, 5, 4, 3}; /* 黑桃,梅花,方塊,紅心 */
char cp[13][2] = {"A ", "2 ", "3 ", "4 ", "5 ", "6 ", "7 ",
	          "8 ", "9 ", "10", "J ", "Q ", "K "};

void main(void)
{
   int i, j;

   clrscr();
   for(i = 0; i <= 3; i++){
      for(j = 0; j <= 12; j++){
         printf("%c%c%c ",cf[i],cp[j][0],cp[j][1]);
      }
      printf("\n");
   }
}