/********************************************************/ 
/*【程式名稱】: 2_dice_toss.c                           */ 
/*【程式功能】: 擲骰子                                  */ 
/*【資料結構】: 陣列結構                                */ 
/********************************************************/ 
/*【變數名稱及用途】                                    */ 
/* count[i] : 用來記錄 i+1 點骰子的出現次數，0 <= i <= 5*/ 
/********************************************************/ 

#include <stdio.h>
void dicetoss(int *count, int n);

void main(void)
{  
   int count[6] = {0};
   int i, n;

   clrscr();
   printf("請輸入擲骰子的次數 : ");
   scanf("%d",&n);
  
   dicetoss(count, n);

   printf("\n\n---------------------------"); 
   printf("\n   共計投擲 %2d 次，其中",n); 
   for(i = 0; i < 6; i++)
      printf("\n      %d 點出現 %2d 次",i+1,count[i]);        
   printf("\n---------------------------\n"); 
}

/********************************************/
/* 利用一個亂數產生函數(式)來模擬骰子的投擲 */
/********************************************/
void dicetoss(int *count, int n)
{
   int i, point;

   for(i = 0; i < n; i++){
      point = rand() % 6 ;
      count[point] = count[point] + 1;
   }
}