/****************************************************/
/*【程式名稱】: 2_m_matrix.c                        */
/*【程式功能】: 矩陣乘積                            */
/*       輸入 : 整數矩陣 a、b                       */
/*       輸出 : 整數矩陣 c = a * b                  */
/*【資料結構】: 陣列結構                            */
/****************************************************/
/*【變數名稱及用途】                                */
/* a[m][n] : 整數矩陣 a                             */
/* b[n][p] : 整數矩陣 b                             */
/* c[n][p] = a[m][n] * b[n][p] ， c 亦為一整數矩陣  */
/****************************************************/

#include <stdio.h>

void main(void)
{  
   int a[10][10] = {0}, b[10][10] = {0}, c[10][10] ={0};
   int i, j, k, m, n, n1, p;

   /*-------------------------*/
   /*   輸入矩陣 a 之元素值   */
   /*-------------------------*/
   clrscr();
   printf("請輸入二維矩陣 a[m][n] 之大小，即 m  n 之值 : ");
   scanf("%d%d",&m,&n);

   printf("\n請按【列】之順序輸入矩陣 a 的元素值:\n");
   for(i = 0; i < m; i++){
      for(j = 0; j < n; j++){
         scanf("%d",&a[i][j]);     /* 輸入矩陣 a 的元素值 */
      }
   }
   printf("\n");

   /*-------------------------*/
   /*    輸入矩陣 b 之元素值  */
   /*-------------------------*/
   while(1){ /* while(true) */
      printf("\n請輸入二維矩陣 b[n][p] 之大小，即 n 與 p 之值 : ");
      scanf("%d%d",&n1,&p);
      if(n != n1)
         printf("==> a 矩陣之行數必須等於 b 矩陣之列數，請重新輸入！\n");
      else
         break;
   }
   printf("\n請按【列】之順序輸入矩陣 b 的元素值:\n");
   for(i = 0; i < n; i++){
      for(j = 0; j < p; j++){
         scanf("%d",&b[i][j]);    /* 輸入矩陣 b 的元素值 */
      }
   }

   /*---------------------------------*/
   /*    c[n][p] = a[m][n] * b[n][p]  */
   /*---------------------------------*/
   for(i = 0; i < m; i++)
      for(j = 0; j < p; j++)
         for(k = 0; k < n; k++)
            c[i][j] = c[i][j] + a[i][k] * b[k][j];

   /*------------------*/
   /*   列印出矩陣 c   */
   /*------------------*/
   printf("\n");
   printf("a x b 之結果如下:\n");
   for(i = 0; i < m; i++){
      for(j = 0; j < p; j++){
         printf("%3d ",c[i][j]);
      }
      printf("\n");
   }
}