/****************************************************/
/*【程式名稱】: 2_r_matrix1.c                       */
/*【程式功能】: 反射矩陣                            */
/*       輸入 : 整數矩陣 M                          */
/*       輸出 : M 的反射矩陣 RM                     */
/*【資料結構】: 陣列結構                            */
/****************************************************/
/*【變數名稱及用途】                                */
/* M[10][10]  : 整數矩陣 M                          */
/* RM[10][10] : 整數矩陣 M 的反射矩陣               */
/****************************************************/

#include <stdio.h>

void main(void)
{
   int M[10][10] = {0}, RM[10][10] = {0};
   int i, j, m, n;

   /*--------------------------------------------*/
   /*   輸入矩陣 M 之元素值，並產生反射矩陣 TM   */
   /*--------------------------------------------*/
   clrscr();
   printf("請輸入二維矩陣 M[m][n] 之大小，即 m  n 之值 : ");
   scanf("%d %d",&m,&n);

   printf("\n請按【列】之順序輸入矩陣 M 的元素值:\n");
   for(i = 0; i < m; i++){
      for(j = 0; j < n; j++){
	 scanf("%d",&M[i][j]);     /* 輸入矩陣 M 的元素值    */
         RM[i][n-j-1] = M[i][j];   /* RM 為矩陣 M 的反射矩陣 */
      }
   }

   /*------------------------*/
   /*    列印出原始矩陣 M    */
   /*------------------------*/
   printf("\n矩陣 M[%d][%d] 的元素資料如下 : \n",m,n);
   for(i = 0; i < m; i++){	
      for(j = 0; j < n; j++){
         printf(" %3d",M[i][j]);
      }
      printf("\n");   }  

   /*---------------------*/
   /*   列印反射矩陣 RM   */
   /*---------------------*/
   printf("\n\n反射矩陣 RM[%d][%d] 的元素資料如下 : \n",m,n);
   for(i = 0; i < m; i++){
      for(j = 0; j < n; j++){
         printf(" %3d",RM[i][j]);
      }
      printf("\n");
   }
}