/****************************************************/
/*【程式名稱】: 2_t_matrix.c                        */
/*【程式功能】: 轉置矩陣                            */
/*       輸入 : 整數矩陣 M                          */
/*       輸出 : M 的轉置矩陣 TM                     */
/*【資料結構】: 陣列結構                            */
/****************************************************/
/*【變數名稱及用途】                                */
/* M[10][10]  : 整數矩陣 M                          */
/* TM[10][10] : 整數矩陣 M 的轉置矩陣               */
/****************************************************/

#include <stdio.h>

void main(void)
{
   int M[10][10] = {0}, TM[10][10] = {0};
   int i, j, m, n;

   /*---------------------------------------------*/
   /*    輸入矩陣 M 之元素值，並產生轉置矩陣 TM   */
   /*---------------------------------------------*/
   clrscr();
   printf("請輸入二維矩陣 M[m][n] 之大小，即 m  n 之值 : ");
   scanf("%d %d",&m,&n);

   printf("\n請按【列】之順序輸入矩陣 M 的元素值:\n");
   for(i = 0; i < m; i++){	
      for(j = 0; j < n; j++){
	 scanf("%d",&M[i][j]);	/* 輸入矩陣 M 的元素值    */
	 TM[j][i] = M[i][j];	/* TM 為矩陣 M 的轉置矩陣 */
      }
   }
  
   /*------------------------*/
   /*    列印出原始矩陣 M    */
   /*------------------------*/
   printf("\n矩陣 M[%d][%d] 的元素資料如下 : \n",m,n);
   for(i = 0; i < m; i++){	
      for(j = 0; j < n; j++){
         printf(" %3d",M[i][j]);
      }
      printf("\n");
   }  

   /*------------------------*/
   /*    列印出轉置矩陣 TM   */
   /*------------------------*/
   printf("\n\n轉置矩陣 TM[%d][%d] 的元素資料如下 : \n",n,m);
   for(i = 0; i < n; i++){	
      for(j = 0; j < m; j++){
         printf(" %3d",TM[i][j]);
      }
      printf("\n");
   }  
}