/*********************************************************/
/*【程式名稱】: 9_s_search.c                             */
/*【程式功能】: 循序搜尋                                 */
/*       輸入 : 一組未經排序的鍵值                       */
/*              要搜尋的鍵值 key                         */
/*       輸出 : 搜尋之結果                               */
/*【資料結構】: 陣列結構                                 */
/*********************************************************/
/*【變數名稱及用途】                                     */
/*        d[] : 儲存待搜尋的鍵值                         */
/*     Size,n : 陣列 d 的大小(元素個數)                  */
/*********************************************************/

#include <stdio.h>
#define Size 16
#define true 1

void print_org_data(const int d[], int n) ;
void s_searching(int d[], int low, int high, int key);

/*--------------------------------------------*/
/*   列印待搜尋的鍵值(陣列 d 共有 n 個元素)   */
/*--------------------------------------------*/
void print_org_data(const int d[], int n) 
{
   int i;

   printf("陣列元素 d[0]  [1]  [2]  [3]  [4]  [5]  [6]  [7]  [8]  [9] [10] [11] [12] [13] [14] [15]\n");
   printf("----------------------------------------------------------------------------------------\n");
   printf("<鍵  值> ");
   for(i = 0; i < n; i++){
      printf("%4d ",d[i]);
   }
   printf("\n----------------------------------------------------------------------------------------\n");
}

/*--------------*/
/*   循序搜尋   */
/*--------------*/
void s_searching(int d[], int low, int high, int key)
{
   int i, count;

   count = 0;
   for(i = low; i <= high; i++){
      if(d[i] == key){
         count++;
         printf("---> 找到了！ d[%d] = %d\n",i,d[i]);
      }
   }
   if(count > 0)
      printf("===> 在陣列 d 中總共有 %d 筆鍵值符合搜尋條件！\n\n",count);
   else
      printf("===> 在陣列 d 中搜尋不到鍵值 %d ！\n\n",key);
}

void main(void)
{
   static int d[Size]={1,75,387,88,35,9,789,157,87,91,95,391,472,31,163,391};
   int key;

   clrscr( );
   while(true){
      print_org_data(d,Size);
      printf("請輸入要搜尋的鍵值 K (要結束時輸入-1) : ");
      scanf("%d",&key);
      if(key == -1) break;
      s_searching(d,0,Size-1,key);
   }
}