/*********************************************************/
/*【程式名稱】: 8_r_sort.c                               */
/*【程式功能】: 基數(箱子)排序法－LSD按「鍵值不遞減」排序*/
/*       輸入 : 一組未經排序的整數鍵值                   */
/*       輸出 : 每一回合排序之結果                       */
/*【資料結構】: 陣列結構                                 */
/*********************************************************/
/*【變數名稱及用途】                                     */
/*        d[] : 儲存待排序的鍵值以及排序過程中每一回合之 */
/*              結果                                     */
/*     Size,n : 陣列 d 的大小(元素個數)                  */
/*********************************************************/

#include <stdio.h>
#define Size 12

void print_org_data(const int d[], int n);
void print_array_data(const int d[], int n);
int  exp(int i, int j);
char allot_and_collect(int d[], int n, int digit);
void bucket_sort_ascending(int d[], int n);

/*------------------------------------------------*/
/*   列印排序前的鍵值資料(陣列 d 共有 n 個元素)   */
/*------------------------------------------------*/
void print_org_data(const int d[], int n) 
{
   int i;

   clrscr( );
   printf("陣列元素    d[0]  [1]  [2]  [3]  [4]  [5]  [6]  [7]  [8]  [9] [10] [11]\n");
   printf("-------------------------------------------------------------------------\n");
   printf("<排序前>==> ");
   for(i = 0; i < n; i++){
      printf("%4d ",d[i]);
   }
   printf("\n-------------------------------------------------------------------------\n");
}

/*---------------------------------------------*/
/*   印出陣列 d 的內容(從 d[low] 到 d[high])   */ 
/*---------------------------------------------*/
void print_array_data(const int d[], int n)
{
   int i;

   for(i = 0; i < n; i++){
      printf("%4d ",d[i]);
   }
   printf("\n");
}

/*----------------------*/
/*   計算 i 的 j 次方   */
/*----------------------*/
int exp(int i, int j)
{
   int k = 1;

   if(j == 0)
      return 1;
   while(j >= 1){
      k = k * i;
      j --;
   }
   return k;
}

/*-----------------------------------*/
/*   以第digit個位數進行分配和收集   */
/*-----------------------------------*/
char allot_and_collect(int d[], int n, int digit)
{
   int bucket[Size][10];  /* 箱子 */
   int b_c[10];           /* b_c[i]代表bucket[][i]的鍵值個數 */
   int i, j, k, p, x;
   char y='N';

   for(i = 0; i < 10; i++)/* 設定b_c[]的初值為0 */
       b_c[i] = 0;
   
   /*-------------------------------------------*/
   /*   分配：將鍵值分配至0、1、...8、9號箱子   */
   /*-------------------------------------------*/
   x = exp(10,digit-1);
   for(i = 0; i < n; i++){      
      p = (d[i] / x) % 10; 
      b_c[p] ++;
      bucket[b_c[p]-1][p] = d[i];      
   }
   /*--------------------------------------------------*/
   /*   收集：將0、1、...8、9號箱子裡的鍵值收集至d[]   */
   /*--------------------------------------------------*/
   k = 0;   
   for(i = 0; i < 10; i++){
      if(b_c[i] == n-1)
         y = 'Y';
      j = 0;
      while(b_c[i] > 0){
         d[k++] = bucket[j++][i];
         b_c[i] = b_c[i] - 1;
      }
   }
   return y;
}

/*---------------------------------*/
/*   基數(箱子)排序法              */
/*     1.陣列 d 共有 n 個元素      */
/*     2.LSD按「鍵值不遞減」排序   */
/*---------------------------------*/
void bucket_sort_ascending(int d[], int n)
{
   int i, j, step;
   char y = 'N';

   step = 0;
   i = 1;

   while(y=='N'){
      y = allot_and_collect(d, n, i);
      i++;
      printf(" 第%d回合 ==> ",++step);
      print_array_data(d, n);
   }
}

void main(void)
{
   int d[Size]={185,66,221,88,700,88,9,1,123,8765,917,2};

   print_org_data(d, Size); /* 列印排序前之鍵值資料 */

   /* 將陣列 d 裡的 Size 個鍵值按「鍵值不遞減」排序 */
   bucket_sort_ascending(d, Size);
}